
#include <stdio.h>

int main()
{
    //2번
    printf("이름    국어   영어   수학   합계   평균\n");
    printf("=======================================\n");
    printf("홍길동  100     90    80    %3d    %4.1f\n", 100 + 90 + 80, (100 + 90 + 80) / 3.0);
    float a = (90 + 100 + 100) / 3;

    printf("%s   %d    %d   %d    %d    %.1f\n", "임꺽정", 90, 100, 100, 90 + 100 + 100, a);

    float b = (80 + 90 + 100) / 3;
    printf("%s   %d     %d   %d    %d    %.1f\n", "성춘향", 80, 90, 100, 80 + 90 + 100, b);
    printf("=======================================\n");
    printf("\n");
}

